app/Controllers/Watcher.php

SELECT *
FROM `runners`
WHERE `bib_number` = '001'
 LIMIT 1
SELECT *
FROM `race_logs`
WHERE `runner_id` = '1'
AND `checkpoint_id` = '1'
 LIMIT 1
INSERT INTO `race_logs` (`runner_id`, `checkpoint_id`, `recorded_at`, `watcher_id`) VALUES ('1', '1', '2026-03-22 18:32:07', '12')
---
public function submitEntry()
{
    $bib = $this->request->getPost('bib_number');
    $checkpoint_id = session()->get('checkpoint_id');

    $runnerModel = new RunnerModel();
    $runner = $runnerModel->where('bib_number', $bib)->first();

    if (!$runner) {
        return redirect()->back()->with('error', "Error: Bib #$bib not found in database.");
    }

    $logModel = new RaceLogModel();

    // Check if runner already passed this specific checkpoint to prevent double entry
    $exists = $logModel->where([
        'runner_id' => $runner['id'],
        'checkpoint_id' => $checkpoint_id
    ])->first();

    if ($exists) {
        return redirect()->back()->with('error', "Runner $bib already recorded at this checkpoint.");
    }

    // ADD THE WATCHER_ID HERE
    $logModel->save([
        'runner_id'     => $runner['id'],
        'checkpoint_id' => $checkpoint_id,
        'recorded_at'   => date('Y-m-d H:i:s'),
        'watcher_id'    => session()->get('id')  // ← ADD THIS LINE
    ]);

SELECT `race_logs`.*, `runners`.`name`, `runners`.`bib_number`
FROM `race_logs`
JOIN `runners` ON `runners`.`id` = `race_logs`.`runner_id`
WHERE `checkpoint_id` = '1'
ORDER BY `recorded_at` DESC
---
    public function viewEntries()
    {
        $checkpoint_id = session()->get('checkpoint_id');

        $logModel = new RaceLogModel();
        $runnerModel = new RunnerModel();

        // Get all entries for this checkpoint
        $entries = $logModel->select('race_logs.*, runners.name, runners.bib_number')
                           ->join('runners', 'runners.id = race_logs.runner_id')
                           ->where('checkpoint_id', $checkpoint_id)
                           ->orderBy('recorded_at', 'DESC')
                           ->findAll();

SELECT *
FROM `race_logs`
WHERE `race_logs`.`id` = '49'
SELECT *
FROM `runners`
WHERE `runners`.`id` = '3'
DELETE FROM `race_logs`
WHERE `id` IN ('49')
---
    public function deleteEntry($entryId)
    {
        $checkpoint_id = session()->get('checkpoint_id');

        $logModel = new RaceLogModel();

        // Get the entry
        $entry = $logModel->find($entryId);

        // Verify this entry belongs to the watcher's checkpoint
        if (!$entry || $entry['checkpoint_id'] != $checkpoint_id) {
            return redirect()->to('/watcher/entries')->with('error', 'Entry not found or access denied.');
        }

        // Get runner details for confirmation message
        $runnerModel = new RunnerModel();
        $runner = $runnerModel->find($entry['runner_id']);

        // Delete the entry
        $logModel->delete($entryId);