app/Models/RaceLogModel.php

SELECT `r`.`name`, `r`.`bib_number`, `u`.`checkpoint_name`, `rl`.`recorded_at`, `c`.`sequence_order`
FROM `race_logs` `rl`
JOIN `runners` `r` ON `r`.`id` = `rl`.`runner_id`
LEFT JOIN `users` `u` ON `u`.`checkpoint_id` = `rl`.`checkpoint_id`
JOIN `checkpoints` `c` ON `c`.`id` = `rl`.`checkpoint_id`
JOIN (SELECT `runner_id`, MAX(checkpoint_id) as max_cp
FROM `race_logs`
GROUP BY `runner_id`) latest ON `latest`.`runner_id` = `rl`.`runner_id` AND `latest`.`max_cp` = `rl`.`checkpoint_id`
ORDER BY `c`.`sequence_order` DESC, `rl`.`recorded_at` ASC
---
public function getLeaderboard()
{
    $db = \Config\Database::connect();

    // This query finds the latest checkpoint reached by each runner
    $subQuery = $db->table('race_logs')
        ->select('runner_id, MAX(checkpoint_id) as max_cp')
        ->groupBy('runner_id')
        ->getCompiledSelect();

    // Now we join that with runners and users (watchers) to get the checkpoint name
    $builder = $this->db->table('race_logs rl');
    $builder->select('r.name, r.bib_number, u.checkpoint_name, rl.recorded_at, c.sequence_order');
    $builder->join('runners r', 'r.id = rl.runner_id');
    $builder->join('users u', 'u.checkpoint_id = rl.checkpoint_id', 'left');
    $builder->join('checkpoints c', 'c.id = rl.checkpoint_id');

    // Join with the subquery to ensure we are only looking at the "furthest" point for each runner
    $builder->join("($subQuery) latest", 'latest.runner_id = rl.runner_id AND latest.max_cp = rl.checkpoint_id');

    // Order by furthest checkpoint first, then by the time they got there
    $builder->orderBy('c.sequence_order', 'DESC');
    $builder->orderBy('rl.recorded_at', 'ASC');

    return $builder->get()->getResultArray();